OpenDTEF-v2012/tutorials/multiphase/overInterDyMFoam/boatAndPropeller/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;


boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "overset.*"
    {
        type            overset;
        value           uniform 1;
    }

    hullWall
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }

    propellerWall
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }

    rudderWall
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }

    defaultFaces
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
}


// ************************************************************************* //
