OpenDTEF-v2012/tutorials/multiphase/overInterDyMFoam/boatAndPropeller/system/topoSetDictRefine.3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    refineSet;       // all around hullBox
        type    cellSet;
        action  new;
        source  zoneToCell;
        zone    hullBox;
    }
    {
        name    refineSet;
        type    cellSet;
        action  subset;
        source  boxToCell;
        boxes
        (
            (0.05 -0.2 -0.2)(0.8 0.2 0.2)
        );
    }
);

// ************************************************************************* //
